name: "trt-bert-uncased"
platform: "tensorrt_plan"
max_batch_size: 1

input [
    {
        name: "input_ids"
        data_type: TYPE_INT64
        dims: [128]
    },
    {
        name: "attention_mask"
        data_type: TYPE_INT64
        dims: [128]
    }
]

output [
    {
        name: "output"
        data_type: TYPE_FP32
        dims: [2]
    }   
]

instance_group [
    {
        count: 1
        kind: KIND_GPU
        gpus: [0]
    }
]

dynamic_batching: { }
