name: "onnx-bert-uncased"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
    {
        name: "input_ids"
        data_type: TYPE_INT64
        dims: [ 16 ]
    },
    {
        name: "attention_mask"
        data_type: TYPE_INT64
        dims: [ 16 ]
    }
]

output [
    {
        name: "output"
        data_type: TYPE_FP32
        dims: [ 2 ]
    }   
]

instance_group [
    {
        count: 1
        kind: KIND_GPU
        gpus: [0]
    }
]

dynamic_batching: { }